Revit 2026 API

# RevitLinkUIUtils Class

---

A class containing functions for displaying user interface related to Revit links.

SystemObject Autodesk.Revit.UIRevitLinkUIUtils

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class RevitLinkUIUtils
```
```vb
Public NotInheritable Class RevitLinkUIUtils
```
```cpp
public ref class RevitLinkUIUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevitLinkUIUtils = class end
```

The RevitLinkUIUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReportLinkLoadResults |  |

#### Reference

Autodesk.Revit.UI Namespace